app/controllers/store_controller.rb

def remove_from_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`order_id`, `updated_at`, `total_price`, `product_id`, `quantity`, `created_at`) VALUES(1, '2009-04-15 08:18:59', 28.5, 1, 1, '2009-04-15 08:18:59')
INSERT INTO `orders` (`name`, `updated_at`, `pay_type`, `address`, `email`, `created_at`) VALUES('Romel Campbell', '2009-04-15 08:18:59', 'check', 'Harlem, USA', 'roca@lundbeck.com', '2009-04-15 08:18:59')